/******************************************
程序功能：通过PC端的串口调试工具，从PC端发出一个十六进制的数，
          通过串口传输到单片机，并有单片机通过
          LED数码管显示出来，而且单片机又将
          这个数发回PC端，并在PC端显示出来，从而
		  实现单片机与PC机的通讯
*****************************************/
#include <reg52.h>
#include "lcd1602.h"
unsigned char date;
//***********************************************************

//                     延时子程序

//************************************************************
void delay1ms()
{
 unsigned int i;
 for(i=40024;i>0;i--);  //延时124*8+10=1002us
}

//******************************

//*****串口初始化函数***********

//******************************
void Initial_com()
{
 EA=1;        //开总中断
 ES=1;        //允许串口中断
 ET1=1;       //允许定时器T1的中断
 TMOD=0x20;   //定时器T1，在方式2中断产生波特率
 PCON=0x00;   //SMOD=0
 SCON=0x50;   // 方式1 由定时器控制
 TH1=0xfd;    //波特率设置为9600
 TL1=0xfd;
 TR1=1;       //开定时器T1运行控制位
}

//*************************
//**********主函数*********
//*************************
void main()
{
	 Initial_com();
	 LCD_Init();
	 LCD_Write_String(0,0,"Serial:p");
	 while(1)
	 {
		 SBUF=0xff;
		 delay1ms();
		 SBUF=0xdd;
		 delay1ms();
		  if(RI)
		  {
			   date=SBUF;    //单片机接受
			   SBUF=date;    //单片机发送
			   LCD_Write_HEX(0,1,date);
			   RI=0;  //必须软件清零
		  }		
		  //LED_display();
	  }
}